app/Controllers/ProductController.php

    public function addProduct()
    {
        $data = $this->request->getJSON(true);

        // Create a dictionary for product data
        $productData = [
            'name' => $data['name'] ?? '',
            'description' => $data['description'] ?? '',
            'price' => $data['price'] ?? 0,
            'quantity_available' => $data['quantity_available'] ?? 0
        ];

        if ($this->productModel->insert($productData)) {
---
INSERT INTO `products` (`name`, `description`, `price`, `quantity_available`) VALUES ('New Product', 'Description of the new product', 50.99, 100)