app/Controllers/Sites.php

SELECT *
FROM `users`
---
    public function listUsers(){
        $users = $this->userObject->findAll();

INSERT INTO `users` (`username`, `email`, `password`) VALUES ('John Doe', 'john.doe@example.com', 'yourpassword')
---
    public function addUser(){
        $data = $this->request->getJSON(true);

        // Extract values into variables
        $name = $data['name'] ?? '';
        $email = $data['email'] ?? '';
        $password = $data['password'] ?? '';

        // Hash the password
        // $hashedPassword = password_hash($password, PASSWORD_DEFAULT);
        $hashedPassword=$password;
        // Prepare data for insertion
        $userData = [
            "username" => $name,
            "email" => $email,
            "password" => $hashedPassword
        ];

        if ($this->userObject->insert($userData)) {